
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

&НаКлиенте
Асинх Процедура Подключаемый_ДЗ_СогласованнаяСкидкаПриИзменении(Элемент)
	// ++ Арканов ДЗ 13-7 от 13.09.2025
	// Добавил обработчик события при изменении скидки
	Если Объект.Товары.Количество() > 0 Или Объект.Услуги.Количество() > 0 Тогда
		Если Ждать ДЗ_ВопросПользователюАсинх() = КодВозвратаДиалога.Да Тогда
			ДЗ_ПересчитатьЦеныАсинх();
		КонецЕсли;
	КонецЕсли;
	// -- Арканов ДЗ 13-7 от 13.09.2025
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	// ++ Арканов ДЗ 13-7 от 13.09.2025
	// Добавление функционала расчета цен со скидкой
	// Удалил
	// КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	// ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	// КонецУдалил
	
	ИтоговаяСкидка = Мин(ТекущиеДанные.Скидка + Объект.ДЗ_СогласованнаяСкидка, 100);
	КоэффициентСкидки = 1 - ИтоговаяСкидка / 100;
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
	Если ТекущиеДанные.Скидка + Объект.ДЗ_СогласованнаяСкидка > 100 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Превышен допустимый процент скидки на: %1", ТекущиеДанные.Скидка + Объект.ДЗ_СогласованнаяСкидка - 100);
		Сообщение.Поле = "Объект." + ТекущийЭлемент.Имя + "[" + (ТекущиеДанные.НомерСтроки - 1) + "].Скидка";
		Сообщение.Сообщить();
	КонецЕсли;
	// -- Арканов ДЗ 13-7 от 13.09.2025
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ДЗ_ПересчитатьЦеныАсинх()
	// ++ Арканов ДЗ 13-7 от 13.09.2025
	// Функция пересчета цен табличных частей документа
	Для Каждого ТабличнаяЧасть Из СтрРазделить("Товары,Услуги", ",") Цикл
		Для Каждого Строка Из Объект[ТабличнаяЧасть] Цикл
			РассчитатьСуммуСтроки(Строка);
		КонецЦикла;
	КонецЦикла;
	
	РассчитатьСуммуДокумента();
	// -- Арканов ДЗ 13-7 от 13.09.2025
КонецПроцедуры

&НаКлиенте
Асинх Функция ДЗ_ВопросПользователюАсинх()
	// ++ Арканов ДЗ 13-7 от 13.09.2025
	Возврат Ждать ВопросАсинх("Рассчитать скидку?", РежимДиалогаВопрос.ДаНет);
	// -- Арканов ДЗ 13-7 от 13.09.2025
КонецФункции


#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ДЗ_ПересчитатьЦены(Команда)
	// ++ Арканов ДЗ 13-7 от 13.09.2025
	// Добавил команду пересчета цен и обработчик события
	Если Объект.Товары.Количество() > 0 Или Объект.Услуги.Количество() > 0 Тогда
		ДЗ_ПересчитатьЦеныАсинх();
	КонецЕсли;
	// -- Арканов ДЗ 13-7 от 13.09.2025
КонецПроцедуры


#КонецОбласти

#КонецОбласти
