#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ЭтоНовыйДокумент = ЭтоНовый();
	
	Если ЭтоНовыйДокумент Тогда
		Сообщение = Справочники.ВКМ_УведомленияТелеграммБоту.СоздатьЭлемент();
		Сообщение.ТекстСообщения = СтрШаблон(
		"Создано новое обращение клиента от %7!
		|
		|Клиент: %1
		|По договору: %2
		|Назначенный специалист: %3
		|Дата работ: %4
		|Время: %5 — %6",
		Клиент,
		Договор,
		Специалист,
		Формат(ДатаПроведенияРабот, "ДЛФ=D"),
		Формат(ВремяНачалаРаботПлан, "ДФ=ЧЧ:мм"),
		Формат(ВремяОкончанияРаботПлан, "ДФ=ЧЧ:мм"),
		Дата);
		Сообщение.Записать();
		
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
	|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
	|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан КАК ВремяНачалаРаботПлан,
	|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРаботПлан КАК ВремяОкончанияРаботПлан
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	ИзменилсяСпециалист = (Специалист <> ВыборкаДетальныеЗаписи.Специалист);
	ИзмениласьДата      = (ДатаПроведенияРабот <> ВыборкаДетальныеЗаписи.ДатаПроведенияРабот);
	ИзменилосьВремя     = (ВремяНачалаРаботПлан <> ВыборкаДетальныеЗаписи.ВремяНачалаРаботПлан)
	ИЛИ (ВремяОкончанияРаботПлан <> ВыборкаДетальныеЗаписи.ВремяОкончанияРаботПлан);
	
	Если ИзменилсяСпециалист ИЛИ ИзмениласьДата ИЛИ ИзменилосьВремя Тогда
		
		ТекстИзменений = "";
		
		Если ИзменилсяСпециалист Тогда
			ТекстИзменений = ТекстИзменений + СтрШаблон(
			"Изменился специалист С %1 НА %2
			|",
			ВыборкаДетальныеЗаписи.Специалист,
			Специалист);
		КонецЕсли;
		
		Если ИзмениласьДата Тогда
			ТекстИзменений = ТекстИзменений + СтрШаблон(
			"Изменилась дата работ С %1 НА %2
			|",
			Формат(ВыборкаДетальныеЗаписи.ДатаПроведенияРабот, "ДЛФ=D"),
			Формат(ДатаПроведенияРабот, "ДЛФ=D")
			);
		КонецЕсли;
		
		Если ИзменилосьВремя Тогда
			ТекстИзменений = ТекстИзменений + СтрШаблон(
			"Изменилось время работ С %1–%2 НА %3–%4",
			Формат(ВыборкаДетальныеЗаписи.ВремяНачалаРаботПлан,    "ДФ=ЧЧ:мм"),
			Формат(ВыборкаДетальныеЗаписи.ВремяОкончанияРаботПлан, "ДФ=ЧЧ:мм"),
			Формат(ВремяНачалаРаботПлан,              "ДФ=ЧЧ:мм"),
			Формат(ВремяОкончанияРаботПлан,           "ДФ=ЧЧ:мм")
			);
		КонецЕсли;
		
		Сообщение = Справочники.ВКМ_УведомленияТелеграммБоту.СоздатьЭлемент();
		Сообщение.ТекстСообщения = СтрШаблон(
		"Изменено обращение клиента №%4 от %5!
		|
		|Клиент: %1
		|По договору: %2
		|%3",
		Клиент,
		Договор,
		ТекстИзменений,
		Номер,
		Дата
		);
		Сообщение.Записать();
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

    Если НЕ ЗначениеЗаполнено(Договор) Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Не указан договор!";
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
    КонецЕсли;

    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |    ДоговорыКонтрагентов.ВидДоговора             КАК ВидДоговора,
    |    ДоговорыКонтрагентов.ВКМ_ДатаНачала         КАК ДатаНачала,
    |    ДоговорыКонтрагентов.ВКМ_ДатаОкончания      КАК ДатаОкончания,
    |    ДоговорыКонтрагентов.ВКМ_СтоимостьЧаса      КАК СтоимостьЧаса
    |ИЗ
    |    Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
    |ГДЕ
    |    ДоговорыКонтрагентов.Ссылка = &Договор
    |    И НЕ ДоговорыКонтрагентов.ПометкаУдаления";
    
    Запрос.УстановитьПараметр("Договор", Договор);
    
    Выборка = Запрос.Выполнить().Выбрать();
    
    Если НЕ Выборка.Следующий() Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Договор не найден или помечен на удаление!";
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    Если Выборка.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Неверный тип договора!";
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    Если НЕ ЗначениеЗаполнено(Выборка.ДатаНачала)
       ИЛИ Выборка.ДатаНачала >= Дата
       ИЛИ Выборка.ДатаОкончания <= Дата Тогда
        
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Проверьте дату действия договора!";
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    СтоимостьЧаса = Выборка.СтоимостьЧаса;
    
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	Сотрудники.ПроцентОтРабот КАК ПроцентОтРабот
    |ИЗ
    |	Справочник.ВКМ_Сотрудники КАК Сотрудники
    |ГДЕ
    |	Сотрудники.Ссылка = &Специалист
    |	И НЕ Сотрудники.ПометкаУдаления";
    
    Запрос.УстановитьПараметр("Специалист", Специалист);
    
    ВыборкаСотрудник = Запрос.Выполнить().Выбрать();
    
    Если НЕ ВыборкаСотрудник.Следующий() Тогда
        
        Сообщение = Новый СообщениеПользователю;
        Сообщение.Текст = "Сотрудник не найден!";
        Сообщение.Сообщить();
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    ПроцентОтРабот = ВыборкаСотрудник.ПроцентОтРабот;
    
    Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать   = Истина;
    Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
    
    Для Каждого Строка Из ВыполненныеРаботы Цикл
        
        Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
        Движение.Период          = Дата;
        Движение.ВидДвижения     = ВидДвиженияНакопления.Приход;
        Движение.Организация     = Организация;
        Движение.Клиент          = Клиент;
        Движение.Договор         = Договор;
        Движение.КоличествоЧасов = Строка.ЧасыКОплатеКлиенту;
        Движение.СуммаКОплате    = СтоимостьЧаса * Строка.ЧасыКОплатеКлиенту;
        
        Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
        Движение.Период       = Дата;
        Движение.ВидДвижения  = ВидДвиженияНакопления.Приход;
        Движение.Сотрудник    = Специалист;
        Движение.ЧасовКОплате = Строка.ЧасыКОплатеКлиенту;
        Движение.СуммаКОплате = Строка.ЧасыКОплатеКлиенту 
                              * СтоимостьЧаса 
                              * ПроцентОтРабот / 100;
        
    КонецЦикла;

КонецПроцедуры

#КонецОбласти
