
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	// ++ Арканов Д.Ю. доработка дипломной работы
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВКМ_ОбслуживаниеКлиента") Тогда
		ЗаполнитьНаОснованииОбслуживанияКлиента(ДанныеЗаполнения);
	КонецЕсли;
	// -- Арканов Д.Ю. доработка дипломной работы
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	// ++ Арканов Д.Ю. доработка дипломной работы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	// -- Арканов Д.Ю. доработка дипломной работы
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
	КонецЦикла;
	
	// ++ Арканов Д.Ю. доработка дипломной работы
	Если Услуги.Количество() > 0 Тогда
		НоменклатураРаботСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
		Для Каждого СтрокУслуги Из Услуги Цикл
			Если СтрокУслуги.Номенклатура = НоменклатураРаботСпециалиста Тогда
				Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.ДобавитьРасход();
				Движение.Период = Дата;
				Движение.Организация = Организация;
				Движение.Клиент = Контрагент;
				Движение.Договор = Договор;
				Движение.СуммаКОплате = СтрокУслуги.Сумма;
				Движение.КоличествоЧасов = СтрокУслуги.Количество;
			Иначе
				Продолжить;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
	// -- Арканов Д.Ю. доработка дипломной работы
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

// ++ Арканов Д.Ю. доработка дипломной работы

Процедура ЗаполнитьНаОснованииОбслуживанияКлиента(ДанныеЗаполнения) 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ОбслуживаниеКлиента.Организация КАК Организация,
	               |	ВКМ_ОбслуживаниеКлиента.Клиент КАК Контрагент,
	               |	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
	               |	ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		ОписаниеРабот КАК Номенклатура,
	               |		ЧасыКОплатеКлиенту КАК Количество,
	               |		Договор.ВКМ_СтоимостьЧаса КАК Цена,
	               |		ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы.ЧасыКОплатеКлиенту * ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьЧаса КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	               |ГДЕ
	               |	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	УслугиОснования = Выборка.Услуги.Выбрать();
		
	Пока УслугиОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
		СуммаДокумента = СуммаДокумента + УслугиОснования.Сумма;
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	// -- Арканов Д.Ю. доработка дипломной работы
КонецПроцедуры

Процедура ВыполнитьАвтозаполнение() Экспорт
	// ++ Арканов Д.Ю. доработка дипломной работы
	НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Если Не ЗначениеЗаполнено(НоменклатураАбонентскаяПлата) ИЛИ Не ЗначениеЗаполнено(НоменклатураРаботыСпециалиста) Тогда
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Проверьте заполнение констант с номенклатурой ""НоменклатураАбонентскаяПлата""
		|и ""НоменклатураРаботыСпециалиста""";
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;
		
	Товары.Очистить();
	Услуги.Очистить();
	
	// Запрос абонентской платы чтобы не получать весь объект
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.ВКМ_АбонентскаяПлата КАК ВКМ_АбонентскаяПлата
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|ГДЕ
		|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	АбонентскаяПлата = ВыборкаДетальныеЗаписи.ВКМ_АбонентскаяПлата;
	// Запрос абонентской платы чтобы получать не весь объект
	
	Если АбонентскаяПлата > 0 Тогда
		НоваяСтрокаТЧУслуги = Услуги.Добавить();
		НоваяСтрокаТЧУслуги.Номенклатура = НоменклатураАбонентскаяПлата;
		НоваяСтрокаТЧУслуги.Количество = 1;
		НоваяСтрокаТЧУслуги.Цена = АбонентскаяПлата;
		НоваяСтрокаТЧУслуги.Сумма = НоваяСтрокаТЧУслуги.Количество * АбонентскаяПлата;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Клиент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ВыполненныеКлиентуРаботы.Клиент КАК Клиент,
	               |	ВКМ_ВыполненныеКлиентуРаботы.Договор КАК Договор,
	               |	ВКМ_ВыполненныеКлиентуРаботы.Организация КАК Организация,
	               |	СУММА(ВКМ_ВыполненныеКлиентуРаботы.КоличествоЧасов) КАК КоличествоЧасов,
	               |	СУММА(ВКМ_ВыполненныеКлиентуРаботы.СуммаКОплате) КАК СуммаКОплате
	               |ИЗ
	               |	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы КАК ВКМ_ВыполненныеКлиентуРаботы
	               |ГДЕ
	               |	ВКМ_ВыполненныеКлиентуРаботы.Клиент = &Клиент
	               |	И ВКМ_ВыполненныеКлиентуРаботы.Договор = &Договор
	               |	И ВКМ_ВыполненныеКлиентуРаботы.Организация = &Организация
	               |	И ВКМ_ВыполненныеКлиентуРаботы.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) И &Период
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_ВыполненныеКлиентуРаботы.Клиент,
	               |	ВКМ_ВыполненныеКлиентуРаботы.Договор,
	               |	ВКМ_ВыполненныеКлиентуРаботы.Организация";

	Результат = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() > 0 Тогда
	
		СуммаКОплате = 0;
		КоличествоЧасовРабот = 0;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СуммаКОплате = СуммаКОплате + ВыборкаДетальныеЗаписи.СуммаКОплате;
			КоличествоЧасовРабот = КоличествоЧасовРабот + ВыборкаДетальныеЗаписи.КоличествоЧасов;
		КонецЦикла;

		НоваяСтрокаТЧУслуги = Услуги.Добавить();
		НоваяСтрокаТЧУслуги.Номенклатура = НоменклатураРаботыСпециалиста;
		НоваяСтрокаТЧУслуги.Количество = КоличествоЧасовРабот;
		НоваяСтрокаТЧУслуги.Цена = СуммаКОплате / КоличествоЧасовРабот;
		НоваяСтрокаТЧУслуги.Сумма = СуммаКОплате;
				
	КонецЕсли;
	
	СуммаДокумента = Услуги.Итог("Сумма");
	// -- Арканов Д.Ю. доработка дипломной работы
КонецПроцедуры

#КонецОбласти

#КонецЕсли
