
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьВидимостьЗарплатныхРеквизитов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДолжностьПриИзменении(Элемент)
	Если Объект.Должность = ПредопределенноеЗначение("Перечисление.ВКМ_Должности.Специалист") Тогда
		Элементы.ПроцентОтРабот.Видимость = Истина;
	Иначе
		Элементы.ПроцентОтРабот.Видимость = Ложь;
		Объект.ПроцентОтРабот = Неопределено;
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьЗарплатныхРеквизитов()
	
	ЕстьПравоНаЗарплату = ПравоДоступа("Изменение", Метаданные.Справочники.ВКМ_Сотрудники)
	                     И ПравоДоступа("Редактирование", Метаданные.Справочники.ВКМ_Сотрудники);
	
	Элементы.Оклад.Видимость          = ЕстьПравоНаЗарплату;
	Элементы.ПроцентОтРабот.Видимость = ЕстьПравоНаЗарплату;
	Элементы.ДействуетС.Видимость     = ЕстьПравоНаЗарплату;
	
КонецПроцедуры

#КонецОбласти
