#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	
	Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;

	Движения.ВКМ_ОтпускаСотрудников.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТЧ.Сотрудник КАК Сотрудник,
	|	СУММА(ТЧ.КоличествоДней) КАК ПланируемыеДниВЭтомДокументе
	|ИЗ
	|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ТЧ
	|ГДЕ
	|	ТЧ.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТЧ.Сотрудник";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить();
		Движение.Период    = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Дней      = Выборка.ПланируемыеДниВЭтомДокументе;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
