#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// ++ Арканов Д.Ю. доработка дипломной работы
	
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ДобавитьЭлементыВКМ(); 
	КонецЕсли;
	// -- Арканов Д.Ю. доработка дипломной работы
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	// ++ Арканов Д.Ю. доработка дипломной работы
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ДобавитьЭлементыВКМ();
	Иначе
		УдалитьЭлементыВКМ(); 
	КонецЕсли;
	// -- Арканов Д.Ю. доработка дипломной работы
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьЭлементыВКМ()
	// ++ Арканов Д.Ю. доработка дипломной работы
	
	НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаНачала", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
	НовыйЭлемент.Заголовок = "Дата начала";
	
	НовыйЭлемент = Элементы.Добавить("ВКМ_ДатаОкончания", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
	НовыйЭлемент.Заголовок = "Дата окончания";
	
	НовыйЭлемент = Элементы.Добавить("ВКМ_АбонентскаяПлата", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
	НовыйЭлемент.Заголовок = "Абонентская плата";
	
	НовыйЭлемент = Элементы.Добавить("ВКМ_СтоимостьЧаса", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧаса";
	НовыйЭлемент.Заголовок = "Стоимость часа";
	// -- Арканов Д.Ю. доработка дипломной работы
КонецПроцедуры

&НаСервере
Процедура УдалитьЭлементыВКМ()
	// ++ Арканов Д.Ю. доработка дипломной работы
	
	Если Элементы.Найти("ВКМ_ДатаНачала") <> Неопределено Тогда
			
		ИменаУдаляемыхЭлементов = Новый Массив;
		ИменаУдаляемыхЭлементов.Добавить("ВКМ_ДатаНачала");
		ИменаУдаляемыхЭлементов.Добавить("ВКМ_ДатаОкончания");
		ИменаУдаляемыхЭлементов.Добавить("ВКМ_АбонентскаяПлата");
		ИменаУдаляемыхЭлементов.Добавить("ВКМ_СтоимостьЧаса");
		
		Для Каждого ЭлементМассива Из ИменаУдаляемыхЭлементов Цикл
			Элементы.Удалить(Элементы[ЭлементМассива]);
			Объект[ЭлементМассива] = Неопределено;
		КонецЦикла;
	КонецЕсли;
	// -- Арканов Д.Ю. доработка дипломной работы
КонецПроцедуры

#КонецОбласти

