
#Область ПрограммныйИнтерфейс

// Добавляет дополнительные реквизиты и элементы управления на форму документа в зависимости от типа формы.
//
// Параметры:
//  ЭтаФорма - ФормаКлиентскогоПриложения - форма документа, на которую добавляются реквизиты и элементы управления.
//
Процедура ДобавитьРеквизитыНаФорму(ЭтаФорма) Экспорт
	ТипРеквизитаСправочникКЛ = Новый ОписаниеТипов("СправочникСсылка.ДЗ_КонтактныеЛица");
	
	ДобавитьПолеКонтактноеЛицо = Новый Структура;
	ДобавитьПолеКонтактноеЛицо.Вставить("Родитель", Неопределено);
	ДобавитьПолеКонтактноеЛицо.Вставить("СледующийЭлемент", Неопределено);
	
	Если ЭтаФорма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		
		ДобавитьПолеКонтактноеЛицо.Родитель = ЭтаФорма.Элементы.ГруппаШапкаПраво;
		ДобавляемыеРеквизиты = Новый Массив;
		РеквизитФормыКЛ = Новый РеквизитФормы("ДЗ_КонтактноеЛицо", ТипРеквизитаСправочникКЛ, "", "Контактное лицо");
		ДобавляемыеРеквизиты.Добавить(РеквизитФормыКЛ);
		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	ИначеЕсли ЭтаФорма.ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента"
		  Или ЭтаФорма.ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицо.Родитель = ЭтаФорма.Элементы.ГруппаШапкаПраво;
		
		ДобавляемыеРеквизиты = Новый Массив;
		РеквизитФормыКЛ = Новый РеквизитФормы("ДЗ_КонтактноеЛицо", ТипРеквизитаСправочникКЛ, "", "Контактное лицо");
		ДобавляемыеРеквизиты.Добавить(РеквизитФормыКЛ);
		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
	ИначеЕсли ЭтаФорма.ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		
		ДобавитьПолеКонтактноеЛицо.СледующийЭлемент = ЭтаФорма.Элементы.Найти("СуммаДокумента");
		
		ДобавляемыеРеквизиты = Новый Массив;
		РеквизитФормыКЛ = Новый РеквизитФормы("ДЗ_КонтактноеЛицо", ТипРеквизитаСправочникКЛ, "", "Контактное лицо");
		ДобавляемыеРеквизиты.Добавить(РеквизитФормыКЛ);
		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
	ИначеЕсли ЭтаФорма.ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		
		ДобавитьПолеКонтактноеЛицо.СледующийЭлемент = ЭтаФорма.Элементы.Найти("Основание");
		
		ДобавляемыеРеквизиты = Новый Массив;
		РеквизитФормыКЛ = Новый РеквизитФормы("ДЗ_КонтактноеЛицо", ТипРеквизитаСправочникКЛ, "", "Контактное лицо");
		ДобавляемыеРеквизиты.Добавить(РеквизитФормыКЛ);
		ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		
	КонецЕсли;
	
	Если ДобавитьПолеКонтактноеЛицо.Родитель <> Неопределено Или ДобавитьПолеКонтактноеЛицо.СледующийЭлемент <> Неопределено Тогда
		ПолеВводаКЛ = ?(ДобавитьПолеКонтактноеЛицо.СледующийЭлемент = Неопределено,
			ЭтаФорма.Элементы.Добавить("ДЗ_КонтактноеЛицо", Тип("ПолеФормы"), ДобавитьПолеКонтактноеЛицо.Родитель),
			ЭтаФорма.Элементы.Вставить("ДЗ_КонтактноеЛицо", Тип("ПолеФормы"), ДобавитьПолеКонтактноеЛицо.Родитель, ДобавитьПолеКонтактноеЛицо.СледующийЭлемент));
		ПолеВводаКЛ.Вид = ВидПоляФормы.ПолеВвода;
		ПолеВводаКЛ.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
		ПолеВводаКЛ.Заголовок = "Контактное лицо";
		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

