
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	Объект.Выплаты.Очистить();
	
	// Получаем сотрудников из тч и суммы задолженности перед ними
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник,
		|	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Период,) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки";
		
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	// Получаем сотрудников из тч и суммы задолженности перед ними
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаТЧ = Объект.Выплаты.Добавить();
		НоваяСтрокаТЧ.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
		НоваяСтрокаТЧ.Сумма = ВыборкаДетальныеЗаписи.СуммаОстаток;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
