
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСообщенияДляОтправки() Экспорт
	
	Сообщения = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграммБоту.Ссылка           КАК Ссылка,
	|	ВКМ_УведомленияТелеграммБоту.ТекстСообщения   КАК ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграммБоту КАК ВКМ_УведомленияТелеграммБоту
	|ГДЕ
	|	НЕ ВКМ_УведомленияТелеграммБоту.ПометкаУдаления";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Сообщ = Новый Структура;
		Сообщ.Вставить("Ссылка",         Выборка.Ссылка);
		Сообщ.Вставить("ТекстСообщения", Выборка.ТекстСообщения);
		Сообщения.Добавить(Сообщ);
	КонецЦикла;
	
	Возврат Сообщения;
	
КонецФункции


Процедура ОтправитьОповещениеВТелеграм() Экспорт
	
	СообщенияДляОтправки = ПолучитьСообщенияДляОтправки();
	
	Если СообщенияДляОтправки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Прокси = Новый ИнтернетПрокси;
	Прокси.Установить("https", "socks5://127.0.0.1", 10808, , , Ложь);
	Прокси.НеИспользоватьПроксиДляЛокальныхАдресов = Ложь;
	
	Токен  = Константы.ВКМ_ТокенУправленияТелеграммБотом.Получить();
	ChatID = Константы.ВКМ_ИдентификаторГруппы.Получить();
	
	Если ПустаяСтрока(Токен) Или ПустаяСтрока(ChatID) Тогда
		ЗаписьЖурналаРегистрации("Telegram", УровеньЖурналаРегистрации.Ошибка, , ,
			"Не указан токен или chat_id");
		Возврат;
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение("api.telegram.org", 443, , ,Прокси , 30, Новый ЗащищенноеСоединениеOpenSSL());
	
	Для Каждого СообщениеДляОтправки Из СообщенияДляОтправки Цикл
		
		Данные = Новый Структура;
		Данные.Вставить("chat_id", ChatID);
		Данные.Вставить("text",    СообщениеДляОтправки.ТекстСообщения);
		
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, Данные);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		HTTPЗапрос = Новый HTTPЗапрос("/bot" + Токен + "/sendMessage");
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		УспешноОтправлено = Ложь;
		
		Попытка
			Ответ = Соединение.ОтправитьДляОбработки(HTTPЗапрос);
			
			Если Ответ.КодСостояния = 200 Тогда
				УспешноОтправлено = Истина;
			Иначе
				ТекстОшибки = Ответ.ПолучитьТелоКакСтроку();
				ЗаписьЖурналаРегистрации("Telegram.Ошибка", УровеньЖурналаРегистрации.Ошибка, , ,
					"Ошибка отправки. Код: " + Ответ.КодСостояния + ". Текст: " + ТекстОшибки + 
					". Сообщение: " + Лев(СообщениеДляОтправки.ТекстСообщения, 120));
			КонецЕсли;
			
		Исключение
			ТекстИсключения = ОписаниеОшибки();
    		ЗаписьЖурналаРегистрации("Telegram.Ошибка", УровеньЖурналаРегистрации.Ошибка, , ,
	        "Исключение при отправке: " + ТекстИсключения + 
	        ". Сообщение: " + Лев(СообщениеДляОтправки.ТекстСообщения, 120));
		КонецПопытки;
		
		// Удаляем  при успехе
		Если УспешноОтправлено Тогда
			Попытка
				СообщениеОбъект = СообщениеДляОтправки.Ссылка.ПолучитьОбъект();
				СообщениеОбъект.УстановитьПометкуУдаления(Истина);
			Исключение
				ЗаписьЖурналаРегистрации("Telegram.ОшибкаУдаления", УровеньЖурналаРегистрации.Ошибка, , ,
					"Не удалось пометить на удаление: " + СообщениеДляОтправки.Ссылка + 
					" → " + ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;

		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
