
#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Запись = РегистрыСведений.ВКМ_УсловияОплатыСотрудников.СоздатьМенеджерЗаписи();
	Запись.Сотрудник   = Ссылка;
	Запись.Период      = ДействуетС;
	Запись.Оклад       = ?(ЗначениеЗаполнено(Оклад), Оклад, 0);
	Запись.ПроцентОтРабот = ?(ЗначениеЗаполнено(ПроцентОтРабот), ПроцентОтРабот, 0);
	
	Попытка
		Запись.Записать(Истина);
	Исключение
		ЗаписьЖурналаРегистрации(
		"Ошибка записи условий оплаты сотрудника",
		УровеньЖурналаРегистрации.Ошибка,
		,
		Ссылка,
		ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
		);
		Отказ = Истина;
	КонецПопытки;
КонецПроцедуры

#КонецОбласти